# Используя список dwarves, выведите на экран с помощью срезов следующие списки:

# ["Двалин", "Бифур", "Бофур"]
# ["Балин", "Бифур", "Бомбур", "Глоин", "Нори", "Фили", "Торин"]
# ["Оин", "Дори", "Ори", "Кили"]
# ["Торин", "Фили", "Нори", "Глоин"]
dwarves = ["Балин", "Двалин", "Бифур", "Бофур",
         "Бомбур", "Оин", "Глоин", "Дори", "Нори",
         "Ори", "Фили", "Кили", "Торин"]

#            0         1        2        3         4         5      6      7         8      9      10      11      12
dwarves = ["Балин", "Двалин", "Бифур", "Бофур", "Бомбур", "Оин", "Глоин", "Дори", "Нори", "Ори", "Фили", "Кили", "Торин"]
print(dwarves[1:4])
print(dwarves[0:13:2])
print(dwarves[5:12:2])
print(dwarves[-1:-9:-2])
