# Используя список dwarves, выведите на экран с помощью срезов следующие списки:

# ["Двалин", "Бифур", "Бофур"]
# ["Балин", "Бифур", "Бомбур", "Глоин", "Нори", "Фили", "Торин"]
# ["Оин", "Дори", "Ори", "Кили"]
# ["Торин", "Фили", "Нори", "Глоин"]
dwarves = ["Балин", "Двалин", "Бифур", "Бофур",
         "Бомбур", "Оин", "Глоин", "Дори", "Нори",
         "Ори", "Фили", "Кили", "Торин"]
list1 = dwarves[1:4]
list2 = dwarves[0::2]
list3 = dwarves[5::2]
x = dwarves [::-1]
y = x[0::2]
list4 = y[0:4]

print(list1)
print(list2)
print(list3)
print(list4)
