# Наименьший делитель
# Пользователь вводит целое число, не меньшее 2
# Выведите его наименьший натуральный делитель, отличный от 1
number = int(input('Ввести целое число большее 2: '))
if number < 2:
    print('Ваше число меньше 2')
else:
    divider = 2
    print(divider)