"""
Найти все числа от 1000 до 3000 включительно, все цифры которых четные.
Программа должна выдавать результат в виде разделенной запятыми строки

"""

x=[]
x=list(range(1000, 3002, 2))
print(x)

# Прошу подсказки!