"""
Найти все числа от 1000 до 3000 включительно, все цифры которых четные.
Программа должна выдавать результат в виде разделенной запятыми строки

"""
some_word = input()
# Считайте ввод и распечатайте:
print(some_word)
# длину слова:
print(len(some_word))
# слово без первой буквы:
print(some_word[1:])
# последний символ слова:
print(some_word[-1])
# слово без последних двух букв:
print(some_word[0:-2])
# слово в uppercase:
print(some_word.upper())


