"""

Дан список из словарей
Напишите программу, которая объединяет значения в один словарь
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]

# ваш код

result_dict = dict()

for every_shop in shops:
    loop_dict = {every_shop['товар']: every_shop['количество']}
    for x in loop_dict:
        if x not in result_dict:
            result_dict.update(loop_dict)
        else:
            result_dict.update({x: sum([loop_dict[x], loop_dict[x]])})

print(result_dict)
