"""

Дан список из словарей
Напишите программу, которая объединяет значения в один словарь
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]

# ваш код
itog_shops = dict()

for line in shops:
    test_shops = {line['товар']: line['количество']}
    for key in test_shops:
        if key not in itog_shops:
            itog_shops.update(test_shops)
        else:
            itog_shops.update({key: sum([test_shops[key], itog_shops[key]])})

print(itog_shops)
