"""

Дан список из словарей
Напишите программу, которая объединяет значения в один словарь
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]

#shops_dict = dict(shops) # Не нашел решения
apple = (shops[0]['товар'])
num_a1 = (shops[0]['количество'])
num_a2 = (shops[2]['количество'])
apple_num = str(num_a1 + num_a2)

bon = (shops[1]['товар'])
num_b1 = (shops[1]['количество'])
print(apple,':', apple_num,',', bon,':', num_b1)

