"""

Дан список из словарей
Напишите программу, которая объединяет значения в один словарь
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]

goods = []

for i in shops:
    goods_key = i.get('товар')
    quantity = i.get('количество')
    goods_dict = {goods_key: quantity}
    goods.append(goods_dict)

result = {}

for dictionary in goods:
    result.update(dictionary)

# сложить количество яблок я не смог
print(result)



