"""

Напишите программу, которая объединяет значения из двух списков.
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]

# ваш код
result_dict = dict()

for row in shops:
    if not row['товар'] in result_dict:
        result_dict[row['товар']] = 0
    result_dict[row['товар']] += row['количество']

print(result_dict)
