"""

Напишите программу, которая объединяет значения из двух списков.
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]

# ваш код
new_shops = dict()
for positions in shops:
    merge = {positions['товар']: positions['количество']}
    for N in merge:
        if N not in new_shops:
            new_shops.update(merge)
        else:
            new_shops.update({N: sum([merge[N], new_shops[N]])})
print(new_shops)