"""
Дан список из словарей
Напишите программу, которая объединяет значения в один словарь
Структура всегда одна и та же - товар и количество
Ввод:
shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:
{'яблоки': 1150, 'конфеты': 300}
""
shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
# ваш код
"""
shop = dict()
for d in shops:
    if not d['товар'] in shop:
        shop[d['товар']] = 0
    shop[d['товар']] = shop[d['товар']] + d['количество']

print(shop)
