"""

Напишите программу, которая объединяет значения из двух списков.
Структура всегда одна и та же - товар и количество

Ввод:

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
Вывод:

{'яблоки': 1150, 'конфеты': 300}

"""

shops = [
    {'товар': 'яблоки', 'количество': 400},
    {'товар': 'конфеты', 'количество': 300},
    {'товар': 'яблоки', 'количество': 750}
]
# ваш код
#some_dict = dict(map(list, shops))
new_dict = dict()
for some_dict in shops:
       line = {some_dict['товар']: some_dict['количество']}
       for key in line:
        if key not in new_dict:
         new_dict.update(line)
        else:
         new_dict.update({key: sum([line[key], new_dict[key]])})
print(new_dict)

#print(x.values())
